export const PROBLEMS = [
    {
        name: "Level 1",
        reward: 1,
        levels: [
            {
                content: `Від парка до магазину 16 метрів, а від магазина до дому в 3 рази менше. 
                    Скільки всього пройшли метрів Гена і Чебурашка, коли повертались із пару додому, зайшовши до магазину?`,
                answer: 224,
            },
            {
                content: `Гена і Чебурашка разом із Шапокляк зловили 24 карасі. Шапокляк зловила стільки ж, 
                    скільки Гена і Чебурашка разом, а вони зловили карасів порівну. Скільки карасів зловив Гена?`,
                answer: 6,
            },
        ],
    },
    {
        name: "Level 2",
        reward: 2,
        levels: [
            {
                content: `У понеділок вранці в колодязі було 1000 л води. Щодня Вовк набирав по 600 л води, 
                    а вночі Заєць доливав половину тієї кількості, що була в колодязі вранці. Чи вистачить води в колодязі до четверга (так / ні)?`,
                answer: "ні",
            },
            {
                content: `Знайдіть найбільш зручним способом суму усіх трицифрових чисел.`,
                answer: 494550,
            },
        ],
    },
    {
        name: "Level 3",
        reward: 4,
        levels: [
            {
                content: `Скільки існує різних восьмицифрових чисел, сума цифр кожного з яких дорівнює 2?`,
                answer: 8,
            },
            {
                content: `Для нумерації сторінок книги використано 2052 цифри. Скільки сторінок у цій книзі?`,
                answer: 720,
            },
        ],
    },
];
